rocksdb/experiments/M2/results/20260429-055153-budget-sensitivity/bmin_6_ptarget_0/budget_on/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:59:37 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777442377968215 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.103 micros/op 123408 ops/sec 40.516 seconds 5000000 operations;  122.4 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.721 micros/op 102869 ops/sec 48.605 seconds 5000000 operations;  102.0 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      11.138 micros/op 89785 ops/sec 55.688 seconds 5000000 operations;   89.1 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     11/0   685.11 MB   2.8      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    483.7     30.90             23.02       240    0.129       0      0       0.0       0.0
  L1     23/1    1.46 GB   5.6     26.5    13.9     12.6      23.3     10.8       0.0   1.7    334.7    294.7     81.07             61.07        19    4.267     26M  3226K       0.0       0.0
  L2     89/2    4.49 GB   1.8     19.6     8.7     10.9      14.8      3.9       0.6   1.7    347.8    262.7     57.81             42.95       133    0.435     19M  4891K       0.0       0.0
 Sum    123/3    6.62 GB   0.0     46.1    22.7     23.5      52.8     29.3       0.6   3.6    278.3    318.2    169.79            127.04       392    0.433     46M  8118K       0.0       0.0
 Int      0/0    0.00 KB   0.0     45.9    22.4     23.5      52.2     28.7       0.6   3.7    278.8    316.8    168.59            126.09       385    0.438     46M  8113K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     46.1    22.7     23.5      38.2     14.7       0.0   0.0    340.2    281.3    138.88            104.02       152    0.914     46M  8118K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    483.7     30.90             23.02       240    0.129       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 144.8 total, 141.8 interval
Flush(GB): cumulative 14.598, interval 14.233
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 52.76 GB write, 373.02 MB/s write, 46.14 GB read, 326.22 MB/s read, 169.8 seconds
Interval compaction: 52.15 GB write, 376.58 MB/s write, 45.89 GB read, 331.39 MB/s read, 168.6 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 18, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 18, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 18, total-stops: 0
interval: 18 total count
Block cache LRUCache@0x55a7368b0df0#84561 capacity: 32.00 MB seed: 227289687 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000182 secs_since: 144
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 144.8 total, 141.8 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 104.31 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 104.31 MB/s
Cumulative stall: 00:00:44.521 H:M:S, 30.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14659.64 MB, 103.37 MB/s
Interval WAL: 14M writes, 0 syncs, 14556580.00 writes per sync, written: 14.32 GB, 103.37 MB/s
Interval stall: 00:00:44.521 H:M:S, 31.4 percent
Write Stall (count): write-buffer-manager-limit-stops: 0